{
  "main": {
    "homeHeader": "Home",
    "greeting": "Hello",
    "name": "I'm Domenic Pittari",
    "rolePrefix": "I'm a ",
    "role1": "Software Engineer",
    "role2": "Front-End Developer",
    "role3": "Game Designer",
    "role4": "Programmer",
    "role5": "Web Developer",
    "role6": "React Developer",
    "projectsHeader": "Projects",
    "candlelightTitle": "Candlelight",
    "candlelightDescription": "Full-Stack Productivity Solution",
    "candlelightContent": "Developed a robust full-stack project centered around user authentication, seamlessly securing user accounts. The platform efficiently loads and manages user-created notes and tasks, providing a streamlined and secure experience for users.",
    "projectMVCTitle": "Project MVC",
    "projectMVCDescription": "3D Shooter Game",
    "projectMVCContent": "Immerse yourself in a dynamic battlefield where waves of enemies relentlessly challenge your skills. The game features a sophisticated enemy wave spawner system that keeps players on their toes, ensuring an ever-intensifying experience.",
    "projectLuminaTitle": "Project Lumina",
    "projectLuminaDescription": "2D Action Platformer",
    "projectLuminaContent": "Embark on a relentless journey through the ever-changing landscapes of Lumina, a dynamic roguelite adventure that challenges players with procedurally generated levels and an extensible character controller.",
    "aboutHeader": "About",
    "about": "My journey as a programmer began in February 2020 when the COVID-19 pandemic led to everyone around the world to move to a working from home enviornment. During this time I experienced a major shift in my life when I finally made the long awaited decision to move to Japan to pursue my dreams and find my place in the world. I then began to proactively teach myself the essentials to software development including Javascript frameworks, back-end authentication and utilising various APIs. In my spare time at and after work, I would dedicate myself to learning all I could and implement my experience into producing various projects ranging from game development, full stack projects and web concepts. I am incredibly driven and dedicated to honing my skills as a programmer and am quick to adapt to the everchaning landscape that is software development. After almost 3 years of living in Japan, I am proud to say that I am still pursuing my dream and am excited for what my future holds for me."
  }
}
